In [7]:
#importing libraries
import pandas as pd
import mysql.connector
import numpy as np

In [8]:
# csv to dataframe
df_bus1=pd.read_csv("df_bus1.csv")
df_bus2=pd.read_csv("df_bus2.csv")
df_bus3=pd.read_csv("df_bus3.csv")
df_bus4=pd.read_csv("df_bus4.csv")
df_bus5=pd.read_csv("df_bus5.csv")
df_bus6=pd.read_csv("df_bus6.csv")
df_bus7=pd.read_csv("df_bus7.csv")
df_bus8=pd.read_csv("df_bus8.csv")
df_bus9=pd.read_csv("df_bus9.csv")
df_bus10=pd.read_csv("df_bus10.csv")

Final_df=pd.concat([df_bus1,df_bus2,df_bus3,df_bus4,df_bus5,df_bus6,
                    df_bus7,df_bus8,df_bus9,df_bus10],ignore_index=True)
Final_df

,Bus_name,Bus_type,Start_time,End_time,Total_duration,Price,Seats_Available,Ratings,Route_link,Route_name
0,APSRTC - 4046,Super Luxury (Non AC Seater 2+2 Push Back),21:00,03:40,06h 40m,INR 469,16 Seats available,4.4\n56,https://www.redbus.in/bus-tickets/vijayawada-t...,Vijayawada to Hyderabad
1,APSRTC - 9651,Super Luxury (Non AC Seater 2+2 Push Back),21:00,04:41,07h 41m,INR 469,23 Seats available,4.0\n9,https://www.redbus.in/bus-tickets/vijayawada-t...,Vijayawada to Hyderabad
2,APSRTC - 9654,Super Luxury (Non AC Seater 2+2 Push Back),21:40,05:20,07h 40m,INR 469,31 Seats available,3.0\n18,https://www.redbus.in/bus-tickets/vijayawada-t...,Vijayawada to Hyderabad
3,APSRTC - 3916,Super Luxury (Non AC Seater 2+2 Push Back),21:45,02:50,05h 05m,INR 469,8 Seats available,4.1\n74,https://www.redbus.in/bus-tickets/vijayawada-t...,Vijayawada to Hyderabad
4,APSRTC - 35179,VENNELA (A.C. SLEEPER),21:45,02:20,04h 35m,INR 781,16 Seats available,4.6\n23,https://www.redbus.in/bus-tickets/vijayawada-t...,Vijayawada to Hyderabad
...,...,...,...,...,...,...,...,...,...,...
2418,SBSTC-SILIGURI - ASANSOL - 2/2 - VIA - MALDA -...,Non AC Seater (2+2),16:00,00:00,08h 00m,INR 225,32 Seats available,3.5\n14,https://www.redbus.in/bus-tickets/siliguri-to-...,Siliguri to Malda
2419,Shyamoli Paribahan Pvt Ltd,Scania Multi-Axle AC Semi Sleeper (2+2),18:20,23:20,05h 00m,INR 500,47 Seats available,3.8\n39,https://www.redbus.in/bus-tickets/siliguri-to-...,Siliguri to Malda
2420,Lokenath Bus Service,Volvo Multi-Axle A/C Seater/Sleeper (2+1),18:45,23:55,05h 10m,INR 649,45 Seats available,4.7\n13,https://www.redbus.in/bus-tickets/siliguri-to-...,Siliguri to Malda
2421,Shyamoli Paribahan Pvt Ltd,NaN,19:30,00:40,05h 10m,NaN,NaN,4.7,https://www.redbus.in/bus-tickets/siliguri-to-...,Siliguri to Malda
2422,WBTC (CTC) KOLKATA - ASANSOL - PURULIA (AC VOL...,Volvo AC Seater (2+2),05:45,08:55,03h 10m,INR 240,31 Seats available,3.8\n85,https://www.redbus.in/bus-tickets/purulia-to-d...,Purulia to Durgapur (West Bengal)

# Data cleaning

In [9]:
# data about the data
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2423 entries, 0 to 2422
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         2325 non-null   object
 1   Bus_type         2314 non-null   object
 2   Start_time       2325 non-null   object
 3   End_time         2325 non-null   object
 4   Total_duration   2325 non-null   object
 5   Price            2323 non-null   object
 6   Seats_Available  2321 non-null   object
 7   Ratings          2325 non-null   object
 8   Route_link       2423 non-null   object
 9   Route_name       2423 non-null   object
dtypes: object(10)
memory usage: 189.4+ KB

In [10]:
#convert prices to numeric
Final_df["Price"]=Final_df["Price"].str.replace("INR","")
Final_df["Price"]=Final_df["Price"].astype(float)
Final_df["Price"].fillna(0)

0       469.0
1       469.0
2       469.0
3       469.0
4       781.0
        ...
2418    225.0
2419    500.0
2420    649.0
2421      0.0
2422    240.0
Name: Price, Length: 2423, dtype: float64

In [11]:
#convert Ratings to numeric
Final_df["Ratings"]=Final_df["Ratings"].str.replace("New","")
Final_df["Ratings"]=Final_df["Ratings"].str.strip()
Final_df["Ratings"]=Final_df["Ratings"].str.split().str[0]
Final_df["Ratings"] = pd.to_numeric(Final_df["Ratings"], errors='coerce')
Final_df["Ratings"].fillna(0,inplace=True)

C:\Users\Prathee\AppData\Local\Temp\ipykernel_5804\2577861265.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  Final_df["Ratings"].fillna(0,inplace=True)

In [12]:
# info after the data type change
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2423 entries, 0 to 2422
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         2325 non-null   object
 1   Bus_type         2314 non-null   object
 2   Start_time       2325 non-null   object
 3   End_time         2325 non-null   object
 4   Total_duration   2325 non-null   object
 5   Price            2323 non-null   float64
 6   Seats_Available  2321 non-null   object
 7   Ratings          2423 non-null   float64
 8   Route_link       2423 non-null   object
 9   Route_name       2423 non-null   object
dtypes: float64(2), object(8)
memory usage: 189.4+ KB

In [13]:
Final_df = Final_df[Final_df["Price"] <= 7000]

In [14]:
# replacing the nan value
Final_df = Final_df.replace({np.nan: None})

In [15]:
# change dataframe to csv
path=r"C:/Users/Prathee/Desktop/redbus/Final_busdetails_df.csv"
Final_df.to_csv(path,index=False)

In [18]:
Final_df.isnull().sum()

Bus_name           0
Bus_type           9
Start_time         0
End_time           0
Total_duration     0
Price              0
Seats_Available    2
Ratings            0
Route_link         0
Route_name         0
dtype: int64

In [21]:
Final_df = Final_df.dropna(subset = ['Bus_type'])

In [22]:
Final_df["Seats_Available"].fillna(0, inplace = True )

C:\Users\Prathee\AppData\Local\Temp\ipykernel_5804\3424650471.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  Final_df["Seats_Available"].fillna(0, inplace = True )

In [23]:
Final_df.isnull().sum()

Bus_name           0
Bus_type           0
Start_time         0
End_time           0
Total_duration     0
Price              0
Seats_Available    0
Ratings            0
Route_link         0
Route_name         0
dtype: int64

# Create a mysql database

In [1]:
import mysql.connector

In [2]:
#sql connection
conn=mysql.connector.connect(host="localhost", user="root", password="iyall")
my_cursor = conn.cursor()
my_cursor.execute("CREATE DATABASE IF NOT EXISTS RED_BUS_DETAILS")

In [4]:
my_cursor.execute("USE RED_BUS_DETAILS")

In [5]:
# Table Creation
my_cursor.execute('''CREATE TABLE IF NOT EXISTS bus_details(
                  ID INT AUTO_INCREMENT PRIMARY KEY,
                  Bus_name VARCHAR(255) NOT NULL,
                  Bus_type VARCHAR(255) NOT NULL,
                  Start_time VARCHAR(255) NOT NULL,
                  End_time VARCHAR(255) NOT NULL,
                  Total_duration VARCHAR(255) NOT NULL,
                  Price FLOAT NULL,
                  Seats_Available VARCHAR(255) NOT NULL,
                  Ratings Float NULL,
                  Route_link VARCHAR(255) NULL,
                  Route_name VARCHAR(255) NULL
                  )''')
print("Table Created successfully")

Table Created successfully

In [24]:
# SQL query to insert data into bus_details table
insert_query = '''INSERT INTO bus_details(
                    Bus_name,
                    Bus_type,
                    Start_time,
                    End_time,
                    Total_duration,
                    Price,
                    Seats_Available,
                    Ratings,
                    Route_link,
                    Route_name)
                  VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data = Final_df.values.tolist()

my_cursor.executemany(insert_query, data)

conn.commit()

print("Values inserted successfully")

Values inserted successfully